import java.io.*;

public class baek_1436 {
    public static void main(String[] args) throws IOException {

        // 666, 1666, 2666, 3666, ..., 9666,
        // 10666, 11666, 12666, 16661, 16662, 16663, 16664, 16665,

        // 13666, 14666, 15666, 17666, 18666, 19666, 20666, 21666,
        // 23666, 24666, 25666, ..., 99666, 100666
        // 101666, 102666, ..., 109666,
        // 110666, 111666,
        //

        // 187번 째 영화의 제목에 들어간 수는 66666 이다
        // 500번 째 영화의 제목에 들어간 수는 166699다

        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));

        int n = Integer.parseInt(br.readLine());

        int cnt = 0;
        String str;
        for (int i = 655; i < 2700000; i++) {
            str = String.valueOf(i);
            if (str.contains("666")) {
                cnt++;
                if (cnt == n) {
                    System.out.print(i);
                    return;
                }
            }

        }

        // 000666 -> 1개 추가 (1~6번 째임) , 여기까지 5666
        // 000766 ~ 006669 -> 10개 추가 (8번째~17번째) x 6개(56669까지), 여기까지 67(7+60)번.
        // 007666 ~ 016669 -> 9개 + 10개, 19개 추가 ( 18번째 ~32번째)
        // 007666 ~ 066699 -> 19개x 6 = 154개

        // 017666 ~ 026660 ~ 026669 -> 9개 + 10개, 19개 추가
        // 007666 ~ 0666XX -> 19개 x

        // 00666XX -> 100개 추가 (68번~168번) x 15개(566699까지), 여기까지 1567(67+1500)번
        // 0066699 -> 0066666 은
        // 0666XXX -> 1000개 추가

        // 666

        // 666XXXX ->

        // 반대로 생각해보자
        // 7자리 수에 6

    }
}
